#include <iostream>
#include <cstdlib>
using namespace std;
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Инициализация генератора случайных чисел:
   srand(2);
   // Индексные переменные:
   int i,j;
   // Размер массива указателей:
   const int size=5;
   // Массив со значениями, определяющими размеры
   // числовых массивов:
   const int cols[size]={3,7,6,4,2};
   // Динамический массив указателей:
   int** nums=new int*[size];
   // Создание динамических числовых массивов
   // и заполнение их значениями:
   for(i=0;i<size;i++){
      // Динамический числовой массив:
      nums[i]=new int[cols[i]];
      cout<<"| ";
      // Заполнение числового массива:
      for(j=0;j<cols[i];j++){
         // Случайное число от 0 до 9:
         nums[i][j]=rand()%10;
         // Отображение значения элемента массива:
         cout<<nums[i][j]<<" | ";
      }
      cout<<endl;
   }
   // Удаление числовых динамических массивов:
   for(i=0;i<size;i++){
      // Удаление динамического числового массива:
      delete [] nums[i];
   }
   // Удаление динамического массива указателей:
   delete [] nums;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}