#include <cstdlib>
#include <cstdio>
using namespace std;
// Глобальная константа:
const int n=3;
// Функция для отображения элементов двумерного массива:
void show(int M[n][n]){
   for(int i=0;i<n;i++){
      for(int j=0;j<n;j++){
         // Отображение элемента массива:
         printf("%4d",M[i][j]);
      }
      // Переход к новой строке:
      printf("\n");
   }
}
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Объявление и инициализация двумерного массива:
   int A[n][n]={{1,-2,1},{2,0,-1},{2,3,-1}};
   printf("Матрица А:\n");
   // Отображение содержимого массива:
   show(A);
   // Объявление и инициализация двумерного массива:
   int B[n][n]={{2,1,-1},{1,3,1},{-2,1,4}};
   printf("Матрица B:\n");
   // Отображение содержимого массива:
   show(B);
   // Объявление двумерного массива:
   int C[n][n];
   // Вычисление произведения матриц:
   for(int i=0;i<n;i++){
      for(int j=0;j<n;j++){
         C[i][j]=0; // Начальное значение элемента
         for(int k=0;k<n;k++){
            C[i][j]+=A[i][k]*B[k][j];
         }
      }
   }
   printf("Матрица C=А*B:\n");
   // Отображение содержимого массива:
   show(C);
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}