#include <iostream>
#include <cstdlib>
using namespace std;
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Символьный массив:
   char str[100]="Программируем на С++";
   // Отображение содержимого символьного массива:
   cout<<str<<endl;
   // Поэлементное отображение содержимого
   // символьного массива:
   for(int k=0;str[k];k++){
      cout<<str[k]<<"_";
   }
   cout<<endl;
   // Отображение содержимого начиная
   // с определенной позиции:
   for(char* p=str;*p;p++){
      cout<<p<<endl;
   }
   // Изменение символа в массиве:
   str[13]='\0';
   // Отображение содержимого массива:
   cout<<str<<endl;
   // Отображение, начиная с указанной позиции:
   cout<<str+14<<endl;
   // Отображение текста, к которому прибавляется число:
   cout<<"Раз два три"+4<<endl;
   // Указатель на символьное значение:
   const char* q="Раз два три"+8;
   // Значение символа, на который ссылается указатель:
   cout<<q[0]<<endl;
   // Отображение значения указателя:
   cout<<q<<endl;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}