#include <iostream>
#include <cstdlib>
using namespace std;
// Аргументами функции передаются указатели:
void swap(char* a,char* b){
   cout<<"Вызывается функция swap()"<<endl;
   // Проверяются значения аргументов функции:
   cout<<"Первая переменная: "<<*a<<endl;
   cout<<"Вторая переменная: "<<*b<<endl;
   // Изменение значений переменных:
   char t=*b;
   *b=*a;
   *a=t;
   for(int i=1;i<=20;i++){
      cout<<"-";
   }
   cout<<endl;
   // Проверяются значения переменных:
   cout<<"Первая переменная: "<<*a<<endl;
   cout<<"Вторая переменная: "<<*b<<endl;
   cout<<"Выполнение функции swap() завершено"<<endl;
}
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Переменные для передачи аргументами функции:
   char x='A',y='B';
   // Проверяются значения переменных:
   cout<<"Первая переменная: "<<x<<endl;
   cout<<"Вторая переменная: "<<y<<endl;
   // Вызов функции:
   swap(&x,&y);
   // Проверяются значения переменных:
   cout<<"Первая переменная: "<<x<<endl;
   cout<<"Вторая переменная: "<<y<<endl;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}