#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
// Объявление функций:
double myCos(double); // Вычисление косинуса
double mySin(double); // Вычисление синуса
void show(double);    // Вспомогательная функция
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Константа для значения числа "пи":
   const double pi=3.141592;
   // Вычисление синуса и косинуса при разных
   // значениях аргумента:
   show(pi/6);
   show(pi/4);
   show(pi/3);
   show(pi/2);
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}
// Описание функции для вычисления косинуса:
double myCos(double x){
   // Верхняя граница суммы:
   int n=100;
   // Переменные для записи значения суммы
   // и добавки к сумме:
   double s=0,q=1;
   // Вычисление суммы:
   for(int k=0;k<=n;k++){
      s+=q; // Добавка к сумме
      // Добавка для следующей итерации:
      q*=(-1)*x*x/(2*k+1)/(2*k+2); 
   }
   // Результат функции:
   return s;
}
// Описание функции для вычисления синуса:
double mySin(double x){
   // Верхняя граница суммы:
   int n=100;
   // Переменные для записи значения суммы
   // и добавки к сумме:
   double s=0,q=x;
   // Вычисление суммы:
   for(int k=0;k<=n;k++){
      s+=q; // Добавка к сумме
      // Добавка для следующей итерации:
      q*=(-1)*x*x/(2*k+2)/(2*k+3);
   }
   // Результат функции:
   return s;
}
// Описание вспомогательной функции:
void show(double x){
   cout<<"Значение аргумента: "<<x<<endl;
   // Вычисление косинуса:
   cout<<"Косинус: "<<myCos(x)<<" vs. "<<cos(x)<<endl;
   // Вычисление синуса:
   cout<<"Синус: "<<mySin(x)<<" vs. "<<sin(x)<<endl;
   // Дополнительный отступ:
   cout<<endl;
}