#include <iostream>
#include <cstdlib>
#include <cmath>
#include <string>
using namespace std;
// Функция для решения уравнения методом
// половинного деления:
double findRoot(double (*f)(double),double a,double b,double dx){
   // Переменная для записи значения корня:
   double x=(a+b)/2;
   // Вычисление корня:
   while((b-a)/2>dx){
      // Если корень попал на левую границу:
      if(f(a)==0){
         return a;
      }
      // Если корень попал на правую границу:
      if(f(b)==0){
         return b;
      }
      // Если корень посредине интервала:
      if(f(x)==0){
         return x;
      }
      // Смещение границы в центр интервала:
      if(f(a)*f(x)>0){
         a=x;
      }
      else{
         b=x;
      }
      // Новое значение для центральной точки интервала:
      x=(a+b)/2;
   }
   // Результат функции:
   return x;
}
// Функции для определения решаемых уравнений:
double f(double x){
   return 0.5*cos(x)-x;
}
double g(double x){
   return exp(-x)-x;
}
double h(double x){
   return x*x-5*x+6;
}
// Вспомогательная функция для решения уравнений
// и тестирования найденных решений:
void test(double (*f)(double),double a,double b,string eq){
   // Контролируемый код:
   try{
      // Если на границах интервала функция уравнения
      // принимает значения одинаковых знаков:
      if(f(a)*f(b)>0){
         // Генерирование ошибки с текстовым объектом:
         throw "Указан неверный диапазон!";
      }
      // Точность вычисления корня:
      double dx=0.001;
      // Переменная для записи значения корня уравнения:
      double z;
      cout<<"Решение уравнения "<<eq<<":\t";
      // Решение уравнения:
      z=findRoot(f,a,b,dx);
      // Отображение результата:
      cout<<z<<endl;
      cout<<"Проверка найденного решения:\t";
      // Проверка решения:
      cout<<f(z)<<" = 0"<<endl;
   }
   // Обработка ошибки:
   catch(char* e){
      // Сообщение о некорректном интервале
      // для поиска корня уравнения:
      cout<<e<<endl;
   }
   for(int k=1;k<=50;k++){
      cout<<"-";
   }
   cout<<endl;
}
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Примеры решения уравнений:
   test(f,0,1,"0.5cos(x)-x=0");
   test(g,0,2,"exp(-x)-x");
   test(h,0,5,"x*x-5*x+6=0");
   test(h,0,2,"x*x-5*x+6=0");
   test(h,1,3,"x*x-5*x+6=0");
   test(h,2.5,4.5,"x*x-5*x+6=0");
   test(h,2.5,10,"x*x-5*x+6=0");
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}