#include <iostream>
#include <cstdlib>
using namespace std;
// Обобщенная функция для отображения массива:
template<class T> void show(T* m,int n){
   for(int i=0;i<n;i++){
      cout<<m[i]<<" ";
   }
   cout<<endl;
}
// Обобщенная функция для сортировки массива:
template<class X> void sort(X* m,int n){
   // Отображение несортированного массива:
   show(m,n);
   // Локальная переменная обобщенного типа:
   X s;
   // Вложенные операторы цикла:
   for(int i=1;i<=n-1;i++){
      for(int j=0;j<n-i;j++){
         if(m[j]>m[j+1]){
            // Обмен значениями соседних элементов:
            s=m[j+1];
            m[j+1]=m[j];
            m[j]=s;
         }
      }
   }
   // Отображение отсортированного массива:
   show(m,n);
}
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Числовой массив:
   int A[5]={3,2,8,1,0};
   // Символьный массив:
   char B[7]={'Z','B','Y','A','D','C','X'};
   // Сортировка массивов:
   sort(A,5);
   sort(B,7);
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}