#include <iostream>
#include <cstdlib>
using namespace std;
// Обобщенный класс для реализации полиномов:
template<int power> class Polynom{
private:
   // Закрытое поле - массив с коэффициентами.
   // Размер массива на единицу больше степени полинома:
   double a[power+1];
public:
   // Конструктор без аргументов:
   Polynom(){
      // Заполнение массива нулями:
      for(int k=0;k<=power;k++){
         a[k]=0;
      }
   }
   // Конструктор с аргументом - именем числового массива:
   Polynom(double* nums){
      // Копирование элементов из одного массива в другой:
      for(int k=0;k<=power;k++){
         a[k]=nums[k];
      }
   }
   // Метод для отображения значений
   // элементов поля - массива:
   void getAll(){
      cout<<"| ";
      for(int k=0;k<=power;k++){
         cout<<a[k]<<" | ";
      }
      cout<<endl;
   }
   // Операторный метод позволяет вызвать объект.
   // Результатом возвращается значение полинома:
   double operator()(double x){
      double s=0,q=1;
      for(int k=0;k<=power;k++){
         s+=a[k]*q;
         q*=x;
      }
      return s;
   }
   // Операторный метод для индексирования объектов:
   double &operator[](int k){
      return a[k];
   }
   // Обобщенный операторный метод для вычисления
   // произведения полиномов:
   template<int n> Polynom<power+n> operator*(Polynom<n> pol){
      // Локальный объект обобщенного класса:
      Polynom<power+n> tmp;
      // Вычисление коэффициентов для
      // полинома - результата:
      for(int i=0;i<=power;i++){
         for(int j=0;j<=n;j++){
            tmp[i+j]+=a[i]*pol[j];
         }
      }
      // Результат метода:
      return tmp;
   }
   // Обобщенный операторный метод для вычисления
   // суммы полиномов:
    template<int n> Polynom<(n>power?n:power)> operator+(Polynom<n> pol){
      int i;
      // Локальный объект обобщенного класса:
      Polynom<(n>power?n:power)> tmp;
      // Вычисление коэффициентов для
      // полинома - результата:
      for(i=0;i<=power;i++){
         tmp[i]+=a[i];
      }
      for(i=0;i<=n;i++){
         tmp[i]+=pol[i];
      }
      // Результат метода:
      return tmp;
   }
};
// Обобщенная операторная функция для вычисления
// результата умножения полинома на число:
template<int power> Polynom<power> operator*(Polynom<power> pol,double r){
   // Локальный объект обобщенного класса:
   Polynom<power> tmp;
   // Вычисление коэффициентов для полинома - результата:
   for(int k=0;k<=power;k++){
      tmp[k]=pol[k]*r;
   }
   // Результат функции:
   return tmp;
}
// Обобщенная операторная функция для вычисления
// результата умножения числа на полином:
template<int power> Polynom<power> operator*(double r,Polynom<power> pol){
   // Полином умножается на число:
   return pol*r;
}
// Обобщенная операторная функция для вычисления
// разности двух полиномов:
template<int m,int n> Polynom<(m>n?m:n)> operator-(Polynom<m> x,Polynom<n> y){
   // К первому полиному прибавляется второй, умноженный
   // на число -1:
   return x+(-1)*y;
}
// Обобщенная функция для вычисления
// производной от полинома:
template<int power> Polynom<power-1> Diff(Polynom<power> pol){
   // Локальный объект обобщенного класса:
   Polynom<power-1> tmp;
   // Вычисление коэффициентов для полинома - результата:
   for(int k=0;k<=power-1;k++){
      tmp[k]=pol[k+1]*(k+1);
   }
   // Результат функции:
   return tmp;
}
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Массивы с коэффициентами:
   double A[]={1,2,-1,1};
   double B[]={-1,3,0,2,-1,1};
   // Аргумент для полиномов:
   double x=2;
   // Первый полином:
   Polynom<3> P(A);
   cout<<"Полином P:\t";
   // Коэффициенты первого полинома:
   P.getAll();
   cout<<"Значение P("<<x<<") = ";
   // Значение первого полинома в точке:
   cout<<P(x)<<endl;
   cout<<"Полином P':\t";
   // Коэффициенты для производной от полинома:
   Diff(P).getAll();
   cout<<"Значение P'("<<x<<") = ";
   // Значение производной в точке:
   cout<<Diff(P)(x)<<endl;
   // Второй полином:
   Polynom<5> Q(B);
   cout<<"Полином Q:\t";
   // Коэффициенты второго полинома:
   Q.getAll();
   cout<<"Значение Q("<<x<<") = ";
   // Значение второго полинома в точке:
   cout<<Q(x)<<endl;
   cout<<"Полином P*Q:\t";
   // Коэффициенты для произведения полиномов:
   (P*Q).getAll();
   cout<<"Значение (P*Q)("<<x<<") = ";
   // Значение произведения полиномов в точке:
   cout<<(P*Q)(x)<<endl;
   cout<<"Полином P+Q:\t";
   // Коэффициенты для суммы полиномов:
   (P+Q).getAll();
   cout<<"Значение (P+Q)("<<x<<") = ";
   // Значение суммы полиномов в точке:
   cout<<(P+Q)(x)<<endl;
   cout<<"Полином Q-P:\t";
   // Коэффициенты для разности полиномов:
   (Q-P).getAll();
   cout<<"Значение (Q-P)("<<x<<") = ";
   // Значение разности полиномов в точке:
   cout<<(Q-P)(x)<<endl;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}