#include <iostream>
#include <cstdlib>
#include <valarray>
using namespace std;
// Класс для реализации полиномов:
class Polynom{
private:
   // Закрытое поле - массив, реализованный через
   // объект класса valarray:
   valarray<double> a;
public:
   // Конструктор с целочисленным аргументом:
   Polynom(int n=0){
      // Определение размера массива
      // и заполнение нулями: 
      a.resize(n+1,0);
   }
   // Конструктор с аргументом - именем числового массива
   // и степенью полинома:
   Polynom(double* nums,int n){
      // Создание нового объекта для массива:
      valarray<double> b(nums,n+1);
      // Присваивание полю нового значения:
      a=b;
   }
   // Результатом метода возвращается степень полинома:
   int power(){
      return a.size()-1;
   }
   // Метод для отображения значений
   // коэффициентов полинома:
   void getAll(){
      cout<<"| ";
      for(int k=0;k<=power();k++){
         cout<<a[k]<<" | ";
      }
      cout<<endl;
   }
   // Операторный метод позволяет вызвать объект.
   // Результатом возвращается значение полинома:
   double operator()(double x){
      // Копия массива с коэффициентами полинома:
      valarray<double> b(a);
      double q=1;
      // Вычисление элементов массива:
      for(int k=0;k<b.size();k++){
         b[k]*=q;
         q*=x;
      }
      // Результат метода - сумма элементов массива:
      return b.sum();
   }
   // Операторный метод для индексирования объектов:
   double &operator[](int k){
      return a[k];
   }
   // Операторный метод для вычисления
   // произведения полиномов:
   Polynom operator*(Polynom pol){
      // Локальный объект:
      Polynom tmp(pol.power()+power());
      // Вычисление коэффициентов для
      // полинома - результата:
      for(int i=0;i<=power();i++){
         for(int j=0;j<=pol.power();j++){
            tmp[i+j]+=a[i]*pol[j];
         }
      }
      // Результат метода:
      return tmp;
   }
   // Операторный метод для вычисления
   // суммы полиномов:
   Polynom operator+(Polynom pol){
      int i;
      int length=pol.power()>power()?pol.power():power();
      // Локальный объект:
      Polynom tmp(length);
      // Вычисление коэффициентов для
      // полинома - результата:
      for(i=0;i<=power();i++){
         tmp[i]+=a[i];
      }
      for(i=0;i<=pol.power();i++){
         tmp[i]+=pol[i];
      }
      // Результат метода:
      return tmp;
   }
};
// Операторная функция для вычисления
// результата умножения полинома на число:
Polynom operator*(Polynom pol,double r){
   // Локальный объект:
   Polynom tmp(pol.power());
   // Вычисление коэффициентов для полинома - результата:
   for(int k=0;k<=pol.power();k++){
      tmp[k]=pol[k]*r;
   }
   // Результат функции:
   return tmp;
}
// Операторная функция для вычисления
// результат умножения числа на полином:
Polynom operator*(double r,Polynom pol){
   // Полином умножается на число:
   return pol*r;
}
// Операторная функция для вычисления разности
// двух полиномов:
Polynom operator-(Polynom x,Polynom y){
   // К первому полиному прибавляется второй, умноженный
   // на число -1:
   return x+(-1)*y;
}
// Обобщенная функция для вычисления
// производной от полинома:
Polynom Diff(Polynom pol){
   // Локальный объект:
   Polynom tmp(pol.power()-1);
   // Вычисление коэффициентов для полинома - результата:
   for(int k=0;k<=tmp.power();k++){
      tmp[k]=pol[k+1]*(k+1);
   }
   // Результат функции:
   return tmp;
}
// Главная функция программы:
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Массивы с коэффициентами:
   double A[]={1,2,-1,1};
   double B[]={-1,3,0,2,-1,1};
   // Аргумент для полиномов:
   double x=2;
   // Объект для записи результатов вычислений:
   Polynom res;
   // Первый полином:
   Polynom P(A,3);
   cout<<"Полином P:\t";
   // Коэффициенты первого полинома:
   P.getAll();
   cout<<"Значение P("<<x<<") = ";
   // Значение первого полинома в точке:
   cout<<P(x)<<endl;
   // Производная:
   res=Diff(P);
   cout<<"Полином P':\t";
   // Коэффициенты для производной от полинома:
   res.getAll();
   cout<<"Значение P'("<<x<<") = ";
   // Значение производной в точке:
   cout<<res(x)<<endl;
   // Второй полином:
   Polynom Q(B,5);
   cout<<"Полином Q:\t";
   // Коэффициенты второго полинома:
   Q.getAll();
   cout<<"Значение Q("<<x<<") = ";
   // Значение второго полинома в точке:
   cout<<Q(x)<<endl;
   // Произведение полиномов:
   res=P*Q;
   cout<<"Полином P*Q:\t";
   // Коэффициенты для произведения полиномов:
   res.getAll();
   cout<<"Значение (P*Q)("<<x<<") = ";
   // Значение произведения полиномов в точке:
   cout<<res(x)<<endl;
   // Сумма полиномов:
   res=P+Q;
   cout<<"Полином P+Q:\t";
   // Коэффициенты для суммы полиномов:
   res.getAll();
   cout<<"Значение (P+Q)("<<x<<") = ";
   // Значение суммы полиномов в точке:
   cout<<res(x)<<endl;
   // Разность полиномов:
   res=Q-P;
   cout<<"Полином Q-P:\t";
   // Коэффициенты для разности полиномов:
   res.getAll();
   cout<<"Значение (Q-P)("<<x<<") = ";
   // Значение разности полиномов в точке:
   cout<<res(x)<<endl;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}