#include <iostream>
#include <cstdlib>
#include <complex>
using namespace std;
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Действительные числа:
   double x=2,y=3;
   // Комплексные числа:
   complex<double> A(3,4),B(2,-1);
   // Сумма комплексных чисел:
   cout<<"Сумма: ";
   cout<<A<<" + "<<B<<" = "<<A+B<<endl;
   // Разность комплексных чисел:
   cout<<"Разность: ";
   cout<<A<<" - "<<B<<" = "<<A-B<<endl;
   // Произведение комплексных чисел:
   cout<<"Произведение: ";
   cout<<A<<" * "<<B<<" = "<<A*B<<endl;
   // Частное комплексных чисел:
   cout<<"Частное: ";
   cout<<A<<" / "<<B<<" = "<<A/B<<endl;
   // Сумма комплексного и действительного чисел:
   cout<<"Сумма: ";
   cout<<A<<" + "<<x<<" = "<<A+x<<endl;
   // Разность комплексного и действительного чисел:
   cout<<"Разность: ";
   cout<<A<<" - "<<x<<" = "<<A-x<<endl;
   // Произведение комплексного и действительного чисел:
   cout<<"Произведение: ";
   cout<<A<<" * "<<x<<" = "<<A*x<<endl;
   // Частное комплексного и действительного чисел:
   cout<<"Частное: ";
   cout<<A<<" / "<<x<<" = "<<A/x<<endl;
   // Сумма действительного и комплексного чисел:
   cout<<"Сумма: ";
   cout<<y<<" + "<<B<<" = "<<y+B<<endl;
   // Разность действительного и комплексного чисел:
   cout<<"Разность: ";
   cout<<y<<" - "<<B<<" = "<<y-B<<endl;
   // Произведение действительного и комплексного чисел:
   cout<<"Произведение: ";
   cout<<y<<" * "<<B<<" = "<<y*B<<endl;
   // Частное действительного и комплексного чисел:
   cout<<"Частное: ";
   cout<<y<<" / "<<B<<" = "<<y/B<<endl;
   // Действительная часть комплексного числа:
   cout<<"Действительная часть: ";
   cout<<"Re"<<A<<" = "<<A.real()<<endl;
   // Мнимая часть комплексного числа:
   cout<<"Мнимая часть: ";
   cout<<"Im"<<A<<" = "<<A.imag()<<endl;
   // Модуль комплексного числа:
   cout<<"Модуль: ";
   cout<<"abs"<<A<<" = "<<abs(A)<<endl;
   // Аргумент комплексного числа:
   cout<<"Аргумент: ";
   cout<<"arg"<<A<<" = "<<arg(A)<<endl;
   // Комплексно-сопряженное число:
   cout<<"Комплексно-сопряженное: ";
   cout<<A<<"* = "<<conj(A)<<endl;
   // Определение числа на основе модуля и аргумента:
   cout<<"Определение числа: ";
   cout<<polar(abs(A),arg(A))<<endl;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}