#include <iostream>
#include <cstdlib>
#include <vector>
using namespace std;
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Переменная для записи размера массива:
   int n;
   cout<<"Числа Фибоначчи\n";
   cout<<"Введите размер массива: ";
   // Считывание размера массива:
   cin>>n;
   // Контролируемый код:
   try{
      // Создание числового массива:
      vector<int> fibs(n,1);
      // Отображение значений первых двух элементов:
      cout<<fibs[0]<<" "<<fibs[1];
      // Заполнение массива и отображение
      // значений элементов массива:
      for(int k=2;k<n;k++){
         fibs[k]=fibs[k-1]+fibs[k-2];
         cout<<" "<<fibs[k];
      }
   }
   // Блок перехвата ошибки:
   catch(...){
      cout<<"Произошла ошибка!";
   }
   cout<<"\nПрограмма завершила выполнение...\n";
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}