#include <iostream>
#include <cstdlib>
#include <set>
using namespace std;
int main(){
   // Изменение кодировки консоли:
   system("chcp 1251>nul");
   // Инициализация генератора случайных чисел:
   srand(2);
   // Количество разных символов:
   int n;
   cout<<"Количество разных символов: ";
   // Считывание значения:
   cin>>n;
   // Создание пустого контейнерного объекта:
   set<char> symbs;
   // Символьная переменная:
   char s;
   // Счетчик символов:
   int counter=0;
   // Заполнение множества:
   while(symbs.size()<n){
      // Случайный символ:
      s='A'+rand()%(n+5);
      // Изменение значения счетчика символов:
      counter++;
      // Отображение сгенерированного символа:
      cout<<s<<" ";
      // Добавление элемента в множество:
      symbs.insert(s);
   }
   cout<<"\nВсего сгенерировано "<<counter<<" символов\n";
   cout<<"Разные символы:\n";
   // Итератор для работы с элементами множества:
   set<char>::iterator p;
   // Итератор установлен на начальный
   // элемент множества:
   p=symbs.begin();
   cout<<"|";
   // Отображается содержимое множества:
   while(p!=symbs.end()){
      // Текущий элемент:
      cout<<" "<<*p<<" |";
      // Итератор на следующий элемент:
      p++;
   }
   cout<<endl;
   // Задержка консольного окна:
   system("pause>nul");
   return 0;
}